#include <iostream>  // Подключаем заголовочный файл
#include <Windows.h>
int main() { // объявляем главную функцию
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);
    // 3,6,7 строки обрабатывают кириллицу
    int nums[10]; // Создание массива с хранением 10 значений
    for (int i = 0; i < 10;i++) {
        std::cout << i << "  элемент массива -- ";
        std::cin >> nums[i];
    } // Ввод элементов массива с клавиатуры
    int summa = 0;
    for (int i = 0; i < 10;i+=2) {
        summa += nums[i];
    } // Условие вывода суммы массивов с чётными индексами
    std::cout << "\n$=========================================$\n";
    std::cout << "Сумма массивов с чётными индексами = " << summa << std::endl; // Вывод суммы на экран
    std::cout << "$=========================================$\n";
        
    return 0; // Вывод результата
}
   
